docs/workInProgress.org
#+SETUPFILE: Setup/setupFile.org
#+TITLE: Work in Progress
#+PROPERTY: header-args:julia :session *directConvolution_session*  :exports code :eval no-export

#+BEGIN_SRC julia :exports none
using Revise
using DirectConvolution
using J4Org
#+END_SRC

#+RESULTS:


* Project Journal
** 2018
*** 2018-04 April
**** 2018-04-06 Friday

***** Doc is online 

Pure Org solution... Experimental

* Project TODO

** TODO [0/1]

- [ ] provide function to compute UDWT adjoint

** TODO Code [0/1]

#+BEGIN_SRC julia :results output drawer :exports results
documented_items=create_documented_item_array_dir("~/GitHub/DirectConvolution.jl/src/");
print_org_doc(documented_items,tag="TODO",header_level=0)
#+END_SRC

#+RESULTS:
:RESULTS:

<<FoQa25pZ>> *Index:* *[U]* [[Sf2bzpcb][UDWT_Filter_Biorthogonal]] 
- @@latex:\phantomsection@@ *=UDWT_Filter_Biorthogonal=*  <<Sf2bzpcb>>
#+BEGIN_SRC julia :eval never :exports code
abstract type UDWT_Filter_Biorthogonal{T<:Number} 
#+END_SRC
#+BEGIN_QUOTE
Abstract type defining the $\phi$, $\psi$, $\tilde{\phi}$ and
$\tilde{\psi}$ filters associated to an undecimated biorthogonal
wavelet transform

- [ ] TODO must use LinearFilter struct
#+END_QUOTE
[[file:/home/picaud/GitHub/DirectConvolution.jl/src/udwt.jl::7][udwt.jl]], [[FoQa25pZ][back to index]]
:END:

* W3 Links

** Readings

This package is based on my posts:
- [[https://pixorblog.wordpress.com/2016/07/17/direct-convolution/][direct-convolution]]
- [[https://pixorblog.wordpress.com/2016/07/13/savitzky-golay-filters-julia/][savitzky-golay-filters-julia]]
- [[https://pixorblog.wordpress.com/2017/01/06/some-remarks-on-the-usage-of-derivatives-in-spectrum-processing/][some-remarks-on-the-usage-of-derivatives-in-spectrum-processing]]
