docs/workInProgress.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-10 Tue 08:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Work in Progress</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="picaud" />
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css" />

</head>
<body>
<div id="content">
<h1 class="title">Work in Progress</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9135411">1. Project Journal</a>
<ul>
<li><a href="#orge7bd39f">1.1. 2018</a>
<ul>
<li><a href="#orgee5c29f">1.1.1. 2018-04 April</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcc83bc4">2. Project TODO</a>
<ul>
<li><a href="#org4ea5a8d">2.1. <span class="todo TODO">TODO</span> <code>[0/1]</code></a></li>
<li><a href="#orgb0e0362">2.2. <span class="todo TODO">TODO</span> Code <code>[1/1]</code></a></li>
</ul>
</li>
<li><a href="#org1d73803">3. W3 Links</a>
<ul>
<li><a href="#orgeab2ba3">3.1. Readings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9135411" class="outline-2">
<h2 id="org9135411"><span class="section-number-2">1</span> Project Journal</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge7bd39f" class="outline-3">
<h3 id="orge7bd39f"><span class="section-number-3">1.1</span> 2018</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgee5c29f" class="outline-4">
<h4 id="orgee5c29f"><span class="section-number-4">1.1.1</span> 2018-04 April</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org766699c"></a>2018-04-06 Friday<br />
<ol class="org-ol">
<li><a id="org6f1af58"></a>Doc is online<br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<p>
Pure Org solution&#x2026; Experimental
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgcc83bc4" class="outline-2">
<h2 id="orgcc83bc4"><span class="section-number-2">2</span> Project TODO</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4ea5a8d" class="outline-3">
<h3 id="org4ea5a8d"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> <code>[0/1]</code></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> provide function to compute UDWT adjoint</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0e0362" class="outline-3">
<h3 id="orgb0e0362"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Code <code>[1/1]</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>

</p>

<p>
<a id="org9b556fe"></a> <b>Index:</b> <b>[U]</b> <a href="#orgcb98967">UDWT_Filter_Biorthogonal</a> 
</p>
<ul class="org-ul">
<li><b><code>UDWT_Filter_Biorthogonal</code></b>  <a id="orgcb98967"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">abstract type</span> <span style="color: #228b22;">UDWT_Filter_Biorthogonal</span>{T<span style="color: #000000; background-color: #ffffff;">&lt;:</span><span style="color: #228b22;">Number</span>} 
</pre>
</div>
<blockquote>
<p>
Abstract type defining the \(\phi\), \(\psi\), \(\tilde{\phi}\) and
\(\tilde{\psi}\) filters associated to an undecimated biorthogonal
wavelet transform
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> TODO must use LinearFilter struct</li>
</ul>
</blockquote>
<p>
<a href="file:///home/picaud/GitHub/DirectConvolution.jl/src/udwt.jl#orge654ea7">udwt.jl</a>, <a href="#org9b556fe">back to index</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org1d73803" class="outline-2">
<h2 id="org1d73803"><span class="section-number-2">3</span> W3 Links</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgeab2ba3" class="outline-3">
<h3 id="orgeab2ba3"><span class="section-number-3">3.1</span> Readings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This package is based on my posts:
</p>
<ul class="org-ul">
<li><a href="https://pixorblog.wordpress.com/2016/07/17/direct-convolution/">direct-convolution</a></li>
<li><a href="https://pixorblog.wordpress.com/2016/07/13/savitzky-golay-filters-julia/">savitzky-golay-filters-julia</a></li>
<li><a href="https://pixorblog.wordpress.com/2017/01/06/some-remarks-on-the-usage-of-derivatives-in-spectrum-processing/">some-remarks-on-the-usage-of-derivatives-in-spectrum-processing</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: picaud</p>
<p class="date">Created: 2018-04-10 Tue 08:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
